package com.javarush.task.task04_ЦиклыТhisМодули.lesson10_ЦиклWhile.task04_ЦиклВыводаТекста;

/* S-квадрат
Вывести на экран квадрат из 10х10 букв S используя цикл while.
Буквы в каждой строке не разделять.
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        //напишите тут ваш код
        int i = 1;
        while (i<=10){
            System.out.println("SSSSSSSSSS");
            i++;
        }

    }
}
