package com.javarush.task.task19.task1907;

/* 
Считаем слово
Считать с консоли имя файла.
Файл содержит слова, разделенные знаками препинания.
Вывести в консоль количество слов «world«, которые встречаются в файле.
Закрыть потоки.


Требования:
1. Программа должна считывать имя файла с консоли (используй BufferedReader).
2. BufferedReader для считывания данных с консоли должен быть закрыт.
3. Программа должна считывать содержимое файла (используй FileReader c конструктором String).
4. Поток чтения из файла (FileReader) должен быть закрыт.
5. Программа должна выводить в консоль количество слов "world", которые встречаются в файле.
*/

import java.io.BufferedReader;
import java.io.FileReader;
import java.io.IOException;
import java.io.InputStreamReader;

public class Solution {
    public static void main(String[] args) throws IOException {
        BufferedReader bufferedReader = new BufferedReader(new InputStreamReader(System.in));
        final String a = bufferedReader.readLine();
        int count = 0;

        BufferedReader fileReader = new BufferedReader(new FileReader(a));
        while (fileReader.ready())
        {
            String[] s = fileReader.readLine().split("[., !?;:-]");
            for (String elem : s)
            {
                if ("world".equals(elem))
                    count++;
            }
        }
        fileReader.close();
        bufferedReader.close();

        System.out.print(count);
    }
}
