package com.javarush.task.task04_ЦиклыТhisМодули.lesson10_ЦиклWhile.task01ЦиклОт1до10;

/* 10 чисел
Вывести на экран числа от 1 до 10 используя цикл while.
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        //напишите тут ваш код
        int a = 1;
        while (a<11){
            System.out.println(a);
            a++;

    }
}}