package com.javarush.task.task03циклыВводСклавы.lesson04_Massiv.task01;

/* Дата рождения
Вывести на экран дату своего рождения в виде: MAY 1 2012
*/

public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код
        System.out.println("MAY 19 1996");
    }
}