package com.javarush.task.task04_ЦиклыТhisМодули.lesson10_ЦиклWhile.task02_ЦиклОт10до1;

/* 10 чисел наоборот
Вывести на экран числа от 10 до 1 используя цикл while.
*/

public class Solution
{
    public static void main(String[] args) throws Exception
    {
        //напишите тут ваш код
        int a = 10;
        while (a>=1) {
            System.out.println(a);
                    a--;}

    }
}
