package com.javarush.task.task03циклыВводСклавы.lesson12.home01;

/* Жить хорошо, а хорошо жить еще лучше
Вывести на экран надпись «Жить хорошо, а хорошо жить еще лучше»
*/

public class Solution
{
    public static void main(String[] args)
    {
        //напишите тут ваш код
        System.out.println("Жить хорошо, а хорошо жить еще лучше");
    }
}
